01  WS-AREA-1 PIC X(100) VALUE SPACES. 01  WS-AREA-2 PIC X(100) VALUE SPACES. PROCEDURE DIVISION.     MOVE "Hello" TO WS-AREA-1.     MOVE "World" TO WS-AREA-2.     DISPLAY WS-AREA-1 WS-AREA-2. STOP RUN.